package com.company.methods;

import com.company.animals.Amphibia;
import com.company.animals.Birds;
import com.company.animals.Fish;
import com.company.animals.Mammals;
import java.util.List;

public class FindSpeciesByCode {

    public static String findSpecies(int code2, int pos) { // Η συνάρτηση αυτή επιστρέφει την ομοταξία όπου ανήκει ο κωδικός.

        // Η λίστα αυτή θα χρησιμοποιηθεί για την εύρεση της ομοταξίας που ανήκει ο κωδικός.
        List<Integer> codes = Amphibia.getCode(); // Παίρνω από τα αμφίβια όλους τους διαθέσιμους κωδικούς.

        if (!codes.isEmpty() && pos < codes.size() && codes.get(pos).equals(code2))
            return "αμφίβια"; // Εάν δεν υπάρχουν διαθέσιμοι κωδικοί στα αμφίβια ή η θέση που βρέθηκε ο κωδικός είναι μεγαλύτερη(ή ίση)
                              // από το μέγεθος της λίστας ή ο κωδικός δεν ανήκει στα αμφίβια, τότε ψάχνω στην επόμενη ομοταξία.

        codes = Birds.getCode(); // Παίρνω από τα πτηνά όλους τους διαθέσιμους κωδικούς.

        if (!codes.isEmpty() && pos < codes.size() && codes.get(pos).equals(code2))
            return "πτηνά"; // Εάν δεν υπάρχουν διαθέσιμοι κωδικοί στα πτηνά ή η θέση που βρέθηκε ο κωδικός είναι μεγαλύτερη(ή ίση)
                            // από το μέγεθος της λίστας ή ο κωδικός δεν ανήκει στα πτηνά, τότε ψάχνω στην επόμενη ομοταξία.

        codes = Fish.getCode(); // Παίρνω από τα ψάρια όλους τους διαθέσιμους κωδικούς.

        if (!codes.isEmpty() && pos < codes.size() && codes.get(pos).equals(code2))
            return "ψάρια"; // Εάν δεν υπάρχουν διαθέσιμοι κωδικοί στα ψάρια ή η θέση που βρέθηκε ο κωδικός είναι μεγαλύτερη(ή ίση)
                            // από το μέγεθος της λίστας ή ο κωδικός δεν ανήκει στα ψάρια, τότε ψάχνω στην επόμενη ομοταξία.

        codes = Mammals.getCode(); // Παίρνω από τα θηλαστικά όλους τους διαθέσιμους κωδικούς.

        if (!codes.isEmpty() && pos < codes.size() && codes.get(pos).equals(code2))
            return "θηλαστικά"; // Εάν δεν υπάρχουν διαθέσιμοι κωδικοί στα θηλαστικά ή η θέση που βρέθηκε ο κωδικός είναι μεγαλύτερη(ή ίση)
                                // από το μέγεθος της λίστας ή ο κωδικός δεν ανήκει στα θηλαστικά, τότε ψάχνω στην επόμενη ομοταξία.

        return "ερπετά"; // Εφόσον δεν ειναι τίποτα από τα πιο πάνω, θα είναι σίγουρα στην ομοταξία ερπετών.

    }

}
